// Webpack - це збирач JS-модулів, менеджер модульних залежностей, який
// аналізує дерево залежностей та створює один або кілька результуючих файлів,
// що містять всю кодову базу проекту. Вибудовує порядок підключення модулів,
// збирає, мініфікує, запаковує та багато іншого.

// Webpack став одним із найважливіших інструментів веб-розробника. В першу
// чергу це менеджер модульних залежностей програми та збирач JS-файлів, але
// він може трансформувати всі ресурси — HTML та CSS, SASS, LESS та PostCSS,
// оптимізувати зображення, компілювати шаблони, запускати локальний веб-
// сервер для розробки та багато іншого.

// Які проблеми вирішує Webpack?
// Зазвичай, при створенні програми на JavaScript код розділяється на кілька
// частин (модулів). Потім у файлі "index.html" необхідно вказати посилання на
// кожен скрипт.

// Type Script - надбудова над JavaScript. Там працює все що і в JavaScript, але з додатковими інструментами. Type Script не заміняє JavaScript, він його розширує.
//Type Script показує помилки відразу

// npm init => npm install typescript --save-dev => npx tsc --init

//----------- EXAMPLE ------------//
